In [1]:
import pandas as pd

In [24]:
df = pd.DataFrame({
    'ID': [101, 102, 103, 104, 105, 106, 107],
    'Name': ['CH', 'KA', 'VE','DH','DE','AY','DH'],
    'Dept': ['HR', 'IT', 'Finance','HR', 'IT', 'Finance','IT'],
    'Salary': [50000, 60000, 70000, 57000, 80000, 55000, 58000]
})

In [ ]:
print(df)

    ID Name     Dept  Salary
0  101   CH       HR   50000
1  102   KA       IT   60000
2  103   VE  Finance   70000
3  104   DH       HR   57000
4  105   DE       IT   80000
5  106   AY  Finance   55000
6  107   DH       IT   58000

In [26]:
df.groupby("Dept")["Salary"].sum()

Dept
Finance    125000
HR         107000
IT         198000
Name: Salary, dtype: int64

In [27]:
df.groupby("Dept")["Name"].count()

Dept
Finance    2
HR         2
IT         3
Name: Name, dtype: int64

In [28]:
df.groupby("Dept")["Salary"].mean()

Dept
Finance    62500.0
HR         53500.0
IT         66000.0
Name: Salary, dtype: float64

In [39]:
df.loc[df.groupby("Dept")["Salary"].idxmax()]

    ID Name     Dept  Salary
2  103   VE  Finance   70000
3  104   DH       HR   57000
4  105   DE       IT   80000

In [34]:
df.groupby("Dept")["Salary"].max()

Dept
Finance    70000
HR         57000
IT         80000
Name: Salary, dtype: int64

In [40]:
dfexcel = pd.read_excel('C:\\Users\\Home\\Downloads\\Documents\\SampleData.xlsx')

In [42]:
dfexcel.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [46]:
dfexcel.groupby("Sex")["Survived"].count()

Sex
female    314
male      577
Name: Survived, dtype: int64

In [51]:
dfexcel.groupby("Pclass")["Sex"].count()

Pclass
1    216
2    184
3    491
Name: Sex, dtype: int64

In [48]:
dfexcel.groupby("Embarked")["Sex"].count()

Embarked
C    168
Q     77
S    644
Name: Sex, dtype: int64

In [53]:
dfexcel[dfexcel["Sex"] == "male"].groupby("Pclass")["Survived"].count()

Pclass
1    122
2    108
3    347
Name: Survived, dtype: int64